LIMPIEZA DEL ARCHIVO player.csv

In [2]:
# 游늷 Importamos las librer칤as necesarias
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# 游늷 Ruta del archivo CSV
ruta = r"C:\Users\User\OneDrive\Documentos\proyecto_final\data_en_csv\madre\player.csv"

# 游늷 Cargamos el CSV
df = pd.read_csv(ruta)

# 游늷 Mostramos las primeras filas para confirmar la carga
df.head()

      id            full_name first_name     last_name  is_active
0  76001       Alaa Abdelnaby       Alaa     Abdelnaby          0
1  76002      Zaid Abdul-Aziz       Zaid    Abdul-Aziz          0
2  76003  Kareem Abdul-Jabbar     Kareem  Abdul-Jabbar          0
3     51   Mahmoud Abdul-Rauf    Mahmoud    Abdul-Rauf          0
4   1505    Tariq Abdul-Wahad      Tariq   Abdul-Wahad          0

- VER INFORMACION GENERAL DEL DATAFRAME

In [3]:
# 游늷 Ver estructura general del DataFrame
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4831 entries, 0 to 4830
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          4831 non-null   int64
 1   full_name   4831 non-null   object
 2   first_name  4825 non-null   object
 3   last_name   4831 non-null   object
 4   is_active   4831 non-null   int64
dtypes: int64(2), object(3)
memory usage: 188.8+ KB

- VERIFICAR VALORES NULOS

In [4]:
# 游늷 Verificamos cantidad y porcentaje de valores nulos por columna
nulos_cantidad = df.isnull().sum()
nulos_porcentaje = (df.isnull().mean() * 100).round(2)

# 游늷 Creamos un DataFrame resumen
nulos_df = pd.DataFrame({
    'Cantidad de nulos': nulos_cantidad,
    'Porcentaje de nulos (%)': nulos_porcentaje
}).sort_values(by='Porcentaje de nulos (%)', ascending=False)

print("游늷 Valores nulos por columna:\n")
print(nulos_df)

游늷 Valores nulos por columna:

            Cantidad de nulos  Porcentaje de nulos (%)
first_name                  6                     0.12
id                          0                     0.00
full_name                   0                     0.00
last_name                   0                     0.00
is_active                   0                     0.00

In [5]:
# 游늷 Mostrar todas las filas que contienen al menos un valor nulo
filas_con_nulos = df[df.isnull().any(axis=1)]

print(f"游늷 Total de filas con al menos un valor nulo: {len(filas_con_nulos)}")
filas_con_nulos

游늷 Total de filas con al menos un valor nulo: 6

           id     full_name first_name     last_name  is_active
1666     2775  Ha Seung-jin        NaN  Ha Seung-jin          0
3129     2403          Nene        NaN          Nene          0
4140   201180       Sun Yue        NaN       Sun Yue          0
4789     2397      Yao Ming        NaN      Yao Ming          0
4795   201146   Yi Jianlian        NaN   Yi Jianlian          0
4821  1627753       Zhou Qi        NaN       Zhou Qi          0

- RELLENADO DE LA COLUMNA FIRST_NAME Y REEMPLAZO DE LOS DATOS EN LA COLUMNA LAST_NAME, EN TODAS LAS FILAS EXCEPTO EN LA QUE TIENE COMO DATO "NENE"

In [6]:
# 游늷 Filtramos las filas con valores nulos (en cualquier columna)
filas_nulas = df[df.isnull().any(axis=1)]

# 游늷 Excluimos el caso donde 'full_name' es exactamente "Nene"
filas_nulas_filtradas = filas_nulas[filas_nulas['full_name'] != 'Nene']

# 游늷 Recorremos las filas con nulos y actualizamos nombres
for idx, fila in filas_nulas_filtradas.iterrows():
    partes = fila['full_name'].split()
    
    if len(partes) > 1:
        df.at[idx, 'last_name'] = partes[0]                    # Primer palabra a last_name
        df.at[idx, 'first_name'] = ' '.join(partes[1:])        # Resto a first_name

In [7]:
# 游늷 Mostramos las filas que originalmente ten칤an valores nulos (incluimos "Nene")
filas_verificadas = df[df['full_name'].isin(filas_nulas['full_name'])]

filas_verificadas

           id     full_name first_name last_name  is_active
1666     2775  Ha Seung-jin  Seung-jin        Ha          0
3129     2403          Nene        NaN      Nene          0
4140   201180       Sun Yue        Yue       Sun          0
4789     2397      Yao Ming       Ming       Yao          0
4795   201146   Yi Jianlian   Jianlian        Yi          0
4821  1627753       Zhou Qi         Qi      Zhou          0

- RELLENAMOS EL VALOR FALTANTE EN LA COLUNMA FIRST_NAME PARA EL FULL_NAME "NENE" CON LA PALABRA "NULL"

In [8]:
# 游늷 Asignamos "NULL" como valor a 'first_name' para el jugador llamado "Nene"
df.loc[df['full_name'] == 'Nene', 'first_name'] = 'null'

In [9]:
# 游늷 Mostrar la fila donde full_name es "Nene"
df[df['full_name'] == 'Nene']

        id full_name first_name last_name  is_active
3129  2403      Nene       null      Nene          0

In [10]:
# 游늷 Mostramos las filas que originalmente ten칤an valores nulos (incluimos "Nene")
filas_verificadas = df[df['full_name'].isin(filas_nulas['full_name'])]

filas_verificadas

           id     full_name first_name last_name  is_active
1666     2775  Ha Seung-jin  Seung-jin        Ha          0
3129     2403          Nene       null      Nene          0
4140   201180       Sun Yue        Yue       Sun          0
4789     2397      Yao Ming       Ming       Yao          0
4795   201146   Yi Jianlian   Jianlian        Yi          0
4821  1627753       Zhou Qi         Qi      Zhou          0

- ANALIZAMOS DUPLICADOS EN ID

In [11]:
# 游늷 Verificar si hay IDs duplicados
duplicados_id = df[df.duplicated(subset='id', keep=False)]

print(f"游늷 Cantidad de IDs duplicados: {duplicados_id['id'].nunique()}")
duplicados_id

游늷 Cantidad de IDs duplicados: 0

Empty DataFrame
Columns: [id, full_name, first_name, last_name, is_active]
Index: []

- ANALIZAMOS DUPLICADOS EN FULL_NAME, FIRST_NAME Y LAST_NAME

In [12]:
# 游늷 Mostrar los primeros 10 duplicados en full_name
duplicados_full_name = df[df.duplicated(subset='full_name', keep=False)]
print(f"游대 Duplicados en full_name: {duplicados_full_name['full_name'].nunique()}")
display(duplicados_full_name.sort_values('full_name').head(10))

# 游늷 Mostrar los primeros 10 duplicados en first_name
duplicados_first_name = df[df.duplicated(subset='first_name', keep=False)]
print(f"游대 Duplicados en first_name: {duplicados_first_name['first_name'].nunique()}")
display(duplicados_first_name.sort_values('first_name').head(10))

# 游늷 Mostrar los primeros 10 duplicados en last_name
duplicados_last_name = df[df.duplicated(subset='last_name', keep=False)]
print(f"游대 Duplicados en last_name: {duplicados_last_name['last_name'].nunique()}")
display(duplicados_last_name.sort_values('last_name').head(10))

游대 Duplicados en full_name: 38

           id         full_name first_name  last_name  is_active
3966    78207        Bill Smith       Bill      Smith          0
3967    78209        Bill Smith       Bill      Smith          0
1137    76609         Bob Duffy        Bob      Duffy          0
1138    76610         Bob Duffy        Bob      Duffy          0
2203    77193       Bobby Jones      Bobby      Jones          0
2204   200784       Bobby Jones      Bobby      Jones          0
4630  1630314  Brandon Williams    Brandon   Williams          0
4629     1585  Brandon Williams    Brandon   Williams          0
1829    76990  Cedric Henderson     Cedric  Henderson          0
1828     1538  Cedric Henderson     Cedric  Henderson          0

游대 Duplicados en first_name: 532

           id      full_name first_name last_name  is_active
4787    78627    A.J. Wynder       A.J.    Wynder          0
1237    76672   A.J. English       A.J.   English          0
1595  1631260     A.J. Green       A.J.     Green          1
1665     2062    A.J. Guyton       A.J.    Guyton          0
2492  1630639    A.J. Lawson       A.J.    Lawson          1
466      1920  A.J. Bramlett       A.J.  Bramlett          0
1632  1631100     AJ Griffin         AJ   Griffin          1
1710  1627773     AJ Hammons         AJ   Hammons          0
3472   201985       AJ Price         AJ     Price          0
2842      243    Aaron McKie      Aaron     McKie          0

游대 Duplicados en last_name: 576

         id          full_name first_name  last_name  is_active
16    76011        Alvan Adams      Alvan      Adams          0
17    76012          Don Adams        Don      Adams          0
18   200801       Hassan Adams     Hassan      Adams          0
19  1629121       Jaylen Adams     Jaylen      Adams          0
20   203919       Jordan Adams     Jordan      Adams          0
21      149      Michael Adams    Michael      Adams          0
22   203500       Steven Adams     Steven      Adams          1
53     2349   Victor Alexander     Victor  Alexander          0
52  1630234  Ty-Shon Alexander    Ty-Shon  Alexander          0
51  1629734     Kyle Alexander       Kyle  Alexander          0

- LECTURA DEL ARCHIVO COMMON_PLAYER_INFO.CSV PARA VERIFICAR COINCIDENCIA EN LOS NOMBRES DUPLICADOS COMPARANDO POR ID

In [13]:
# 游늷 Ruta del nuevo archivo CSV
ruta_common = r"C:\Users\User\OneDrive\Documentos\proyecto_final\data_en_csv\madre\common_player_info.csv"

# 游늷 Cargamos el archivo
df_common = pd.read_csv(ruta_common)

# 游늷 Mostramos las primeras filas para confirmar la carga
df_common.head()

,person_id,first_name,last_name,display_first_last,display_last_comma_first,display_fi_last,player_slug,birthdate,school,country,...,playercode,from_year,to_year,dleague_flag,nba_flag,games_played_flag,draft_year,draft_round,draft_number,greatest_75_flag
0,76001,Alaa,Abdelnaby,Alaa Abdelnaby,"Abdelnaby, Alaa",A. Abdelnaby,alaa-abdelnaby,24/6/1968,Duke,USA,...,HISTADD_alaa_abdelnaby,1990.0,1994.0,N,Y,Y,1990,1,25,N
1,76003,Kareem,Abdul-Jabbar,Kareem Abdul-Jabbar,"Abdul-Jabbar, Kareem",K. Abdul-Jabbar,kareem-abdul-jabbar,16/4/1947,UCLA,USA,...,HISTADD_kareem_abdul-jabbar,1969.0,1988.0,N,Y,Y,1969,1,1,Y
2,1505,Tariq,Abdul-Wahad,Tariq Abdul-Wahad,"Abdul-Wahad, Tariq",T. Abdul-Wahad,tariq-abdul-wahad,3/11/1974,San Jose State,France,...,tariq_abdul-wahad,1997.0,2003.0,N,Y,Y,1997,1,11,N
3,949,Shareef,Abdur-Rahim,Shareef Abdur-Rahim,"Abdur-Rahim, Shareef",S. Abdur-Rahim,shareef-abdur-rahim,11/12/1976,California,USA,...,shareef_abdur-rahim,1996.0,2007.0,N,Y,Y,1996,1,3,N
4,76005,Tom,Abernethy,Tom Abernethy,"Abernethy, Tom",T. Abernethy,tom-abernethy,6/5/1954,Indiana,USA,...,HISTADD_tom_abernethy,1976.0,1980.0,N,Y,Y,1976,3,43,N

In [17]:
import pandas as pd

- CREACION DEL DATA FRAME CON LO VALORES DUPLICADOS DE LA TABLA PLAYER EN LA COLUMNA FULL_NAME

In [18]:
# 游늷 Filtrar las filas que tienen nombres duplicados (hom칩nimos)
duplicados_fullname_df = df[df.duplicated(subset='full_name', keep=False)].copy()

# 游늷 Ordenamos por nombre para facilitar la revisi칩n
duplicados_fullname_df = duplicados_fullname_df.sort_values(by='full_name')

# 游늷 Mostrar cantidad total de duplicados encontrados
print(f"游대 Total de filas con full_name duplicado: {len(duplicados_fullname_df)}")

# 游늷 Mostrar el DataFrame
duplicados_fullname_df

游대 Total de filas con full_name duplicado: 78

          id       full_name first_name last_name  is_active
3966   78207      Bill Smith       Bill     Smith          0
3967   78209      Bill Smith       Bill     Smith          0
1137   76609       Bob Duffy        Bob     Duffy          0
1138   76610       Bob Duffy        Bob     Duffy          0
2203   77193     Bobby Jones      Bobby     Jones          0
...      ...             ...        ...       ...        ...
2963  203183   Tony Mitchell       Tony  Mitchell          0
3749  201041  Walker Russell     Walker   Russell          0
3748   78048  Walker Russell     Walker   Russell          0
2254   77203    Willie Jones     Willie     Jones          0
2253   77202    Willie Jones     Willie     Jones          0

[78 rows x 5 columns]

In [20]:
# 游늷 Extraer los sets de IDs de cada DataFrame
ids_df = set(df['id'])
ids_common = set(df_common['person_id'])

# 游늷 Comparar coincidencias
ids_en_ambos = ids_df.intersection(ids_common)
ids_solo_en_df = ids_df - ids_common
ids_solo_en_common = ids_common - ids_df

# 游늷 Mostrar resultados
print(f"游댕 IDs en ambos DataFrames: {len(ids_en_ambos)}")
print(f"游릭 IDs solo en df: {len(ids_solo_en_df)}")
print(f"游댯 IDs solo en df_common: {len(ids_solo_en_common)}")

游댕 IDs en ambos DataFrames: 4171
游릭 IDs solo en df: 660
游댯 IDs solo en df_common: 0

In [22]:
# 游늷 Extraer sets de ID
ids_duplicados = set(duplicados_fullname_df['id'])
ids_common = set(df_common['person_id'])

# 游늷 Comparar
ids_coinciden = ids_duplicados.intersection(ids_common)
ids_no_coinciden = ids_duplicados - ids_common

# 游늷 Mostrar resultados
print(f"九 Coincidencias de ID con df_common: {len(ids_coinciden)}")
print(f"仇 Sin coincidencia en df_common: {len(ids_no_coinciden)}")

九 Coincidencias de ID con df_common: 70
仇 Sin coincidencia en df_common: 8

In [23]:
# 游늷 Extraer IDs que no coinciden
ids_duplicados = set(duplicados_fullname_df['id'])
ids_common = set(df_common['person_id'])
ids_no_coinciden = ids_duplicados - ids_common

# 游늷 Filtrar filas cuyo ID no est치 en df_common
duplicados_sin_match = duplicados_fullname_df[duplicados_fullname_df['id'].isin(ids_no_coinciden)]

# 游늷 Mostrar resultado
print(f"仇 Filas sin coincidencia en df_common: {len(duplicados_sin_match)}")
duplicados_sin_match

仇 Filas sin coincidencia en df_common: 8

           id        full_name first_name last_name  is_active
2204   200784      Bobby Jones      Bobby     Jones          0
2144  1630525    David Johnson      David   Johnson          0
4337    78382      Jack Turner       Jack    Turner          0
2166     2256      Ken Johnson        Ken   Johnson          0
3087     1823  Makhtar N'diaye    Makhtar   N'diaye          0
1662    76909      Matt Guokas       Matt    Guokas          0
1266      121    Patrick Ewing    Patrick     Ewing          0
2253    77202     Willie Jones     Willie     Jones          0

- SE ELIMINAN DE LA TABLA PLAYES, LAS FILAS QUE NO ENCONRARON COINCIDENCIA CON EL PERSON_ID DE LA TABLA COMMON_PLAYER

In [24]:
# 游늷 Eliminar las filas de df cuyo ID est치 en duplicados_sin_match
df = df[~df['id'].isin(duplicados_sin_match['id'])]

# 游늷 Confirmamos que se eliminaron correctamente
print(f"九 Nuevo total de filas en df: {len(df)}")

九 Nuevo total de filas en df: 4823

- VERIFICAMOS QUE NO HAYA DUPLICADOS EN LA COLUMNA ID DEL DF PLAYER

In [26]:
# 游늷 Verificar si hay valores duplicados en 'id'
duplicados_id = df['id'].duplicated().sum()
print(f"游대 Cantidad de IDs duplicados en df: {duplicados_id}")

# 游늷 Verificar si hay valores nulos en 'id'
nulos_id = df['id'].isnull().sum()
print(f"仇 Cantidad de IDs vac칤os (nulos) en df: {nulos_id}")

游대 Cantidad de IDs duplicados en df: 0
仇 Cantidad de IDs vac칤os (nulos) en df: 0

- SE FILTRAN SOLO LOS JUGADORES INACTIVOS

In [25]:
# 游늷 Filtrar jugadores inactivos
df_inactivos = df[df['is_active'] == 0][['id', 'is_active']].copy()

# 游늷 Mostrar el resultado
print(f"游늷 Total de jugadores inactivos: {len(df_inactivos)}")
df_inactivos

游늷 Total de jugadores inactivos: 4241

           id  is_active
0       76001          0
1       76002          0
2       76003          0
3          51          0
4        1505          0
...       ...        ...
4825  1627835          0
4826  1627790          0
4827    78647          0
4828    78648          0
4830    78650          0

[4241 rows x 2 columns]

- EXPORTAMOS LA TABLA PLAYER SIN LOS DUPLICADOS Y CON LOS VALORES FALTANTES RELLENADO

In [27]:
# 游늷 Exportar el DataFrame limpio a CSV
df.to_csv(r"C:\Users\User\OneDrive\Documentos\proyecto_final\data_en_csv\player_filtrado_sin_duplicados.csv", index=False)

print("九 Archivo exportado correctamente como player_filtrado_sin_duplicados.csv")

九 Archivo exportado correctamente como player_filtrado_sin_duplicados.csv

- VERIFICAMOS CUANTAS FILAS DE CADA COLUMNA TIENE EL ICONO "-"

In [30]:
# 游늷 Verificar cu치ntos valores contienen el s칤mbolo '-' en cada columna del DataFrame df
conteo_guiones = {
    'full_name': df['full_name'].str.contains('-', na=False).sum(),
    'first_name': df['first_name'].str.contains('-', na=False).sum(),
    'last_name': df['last_name'].str.contains('-', na=False).sum()
}

# 游늷 Mostrar resultados
print("游댍 Cantidad de valores que contienen '-' en cada columna:")
for columna, cantidad in conteo_guiones.items():
    print(f"郊쀮잺 {columna}: {cantidad}")

# 游늷 Mostrar ejemplos (primeros 10) en cada columna
print("\n游늶 Ejemplos de valores con '-' en full_name:")
display(df[df['full_name'].str.contains('-', na=False)].head(10))

print("\n游늶 Ejemplos de valores con '-' en first_name:")
display(df[df['first_name'].str.contains('-', na=False)].head(10))

print("\n游늶 Ejemplos de valores con '-' en last_name:")
display(df[df['last_name'].str.contains('-', na=False)].head(10))

游댍 Cantidad de valores que contienen '-' en cada columna:
郊쀮잺 full_name: 37
郊쀮잺 first_name: 4
郊쀮잺 last_name: 33

游늶 Ejemplos de valores con '-' en full_name:

          id                 full_name first_name         last_name  is_active
1      76002           Zaid Abdul-Aziz       Zaid        Abdul-Aziz          0
2      76003       Kareem Abdul-Jabbar     Kareem      Abdul-Jabbar          0
3         51        Mahmoud Abdul-Rauf    Mahmoud        Abdul-Rauf          0
4       1505         Tariq Abdul-Wahad      Tariq       Abdul-Wahad          0
5        949       Shareef Abdur-Rahim    Shareef       Abdur-Rahim          0
37   1629152    DeVaughn Akoon-Purcell   DeVaughn     Akoon-Purcell          0
52   1630234         Ty-Shon Alexander    Ty-Shon         Alexander          0
54   1629638  Nickeil Alexander-Walker    Nickeil  Alexander-Walker          1
78    202329           Al-Farouq Aminu  Al-Farouq             Aminu          0
254  1628966          Keita Bates-Diop      Keita        Bates-Diop          1

游늶 Ejemplos de valores con '-' en first_name:

           id           full_name    first_name  last_name  is_active
52    1630234   Ty-Shon Alexander       Ty-Shon  Alexander          0
78     202329     Al-Farouq Aminu     Al-Farouq      Aminu          0
1666     2775        Ha Seung-jin     Seung-jin         Ha          0
4304  1626157  Karl-Anthony Towns  Karl-Anthony      Towns          1

游늶 Ejemplos de valores con '-' en last_name:

,id,full_name,first_name,last_name,is_active
1,76002,Zaid Abdul-Aziz,Zaid,Abdul-Aziz,0
2,76003,Kareem Abdul-Jabbar,Kareem,Abdul-Jabbar,0
3,51,Mahmoud Abdul-Rauf,Mahmoud,Abdul-Rauf,0
4,1505,Tariq Abdul-Wahad,Tariq,Abdul-Wahad,0
5,949,Shareef Abdur-Rahim,Shareef,Abdur-Rahim,0
37,1629152,DeVaughn Akoon-Purcell,DeVaughn,Akoon-Purcell,0
54,1629638,Nickeil Alexander-Walker,Nickeil,Alexander-Walker,1
254,1628966,Keita Bates-Diop,Keita,Bates-Diop,1
430,2257,Ruben Boumtje-Boumtje,Ruben,Boumtje-Boumtje,0
648,203484,Kentavious Caldwell-Pope,Kentavious,Caldwell-Pope,1

- UNIFICAMOS LA ESCRITURA DE LA TABLA PLAYER EN LAS COLUMNAS LAST_NAME Y FIRST_NAME

In [38]:
import re

# -------------------------------------
# 游댳 Paso 1: Limpieza general (espacios, capitalizaci칩n)
# -------------------------------------

# Funci칩n de limpieza general (mantiene guiones)
def limpiar_columna(columna):
    return (
        df[columna]
        .astype(str)
        .str.strip()                         # eliminar espacios al inicio y final
        .str.replace(r'\s+', ' ', regex=True) # unificar espacios m칰ltiples
        .str.title()                         # capitalizar (mantiene guiones)
    )

# Aplicar limpieza general a full_name, first_name y last_name
df['full_name'] = limpiar_columna('full_name')
df['first_name'] = limpiar_columna('first_name')
df['last_name'] = limpiar_columna('last_name')

# -------------------------------------
# 游댳 Paso 2: Estandarizar iniciales en first_name (ej: "AJ"  "A.J.")
# -------------------------------------

# Funci칩n para estandarizar iniciales tipo "AJ", "A J", "A. J.", etc.
def estandarizar_iniciales(nombre):
    patron = re.compile(r'^([A-Z])\.?\s*([A-Z])\.?$')
    if pd.isna(nombre):
        return nombre
    nombre = nombre.strip().upper()
    match = patron.match(nombre)
    if match:
        return f"{match.group(1)}.{match.group(2)}."
    return nombre.title()

# Aplicar estandarizaci칩n solo a first_name
df['first_name'] = df['first_name'].apply(estandarizar_iniciales)

# -------------------------------------
# 游댳 Paso 3: Validaci칩n visual (opcional)
# -------------------------------------

# 游늷 Mostrar las primeras 20 filas del DataFrame despu칠s de la limpieza
print("\n游늶 Primeras 20 filas del DataFrame modificado:")
df.head(20)

游늶 Primeras 20 filas del DataFrame modificado:

         id            full_name first_name     last_name  is_active
0     76001       Alaa Abdelnaby       Alaa     Abdelnaby          0
1     76002      Zaid Abdul-Aziz       Zaid    Abdul-Aziz          0
2     76003  Kareem Abdul-Jabbar     Kareem  Abdul-Jabbar          0
3        51   Mahmoud Abdul-Rauf    Mahmoud    Abdul-Rauf          0
4      1505    Tariq Abdul-Wahad      Tariq   Abdul-Wahad          0
5       949  Shareef Abdur-Rahim    Shareef   Abdur-Rahim          0
6     76005        Tom Abernethy        Tom     Abernethy          0
7     76006          Forest Able     Forest          Able          0
8     76007       John Abramovic       John     Abramovic          0
9    203518         Alex Abrines       Alex       Abrines          0
10  1630173     Precious Achiuwa   Precious       Achiuwa          1
11   101165           Alex Acker       Alex         Acker          0
12    76008      Donald Ackerman     Donald      Ackerman          0
13    76009           Mark Acres       Mark         Acres          0
14    76010        Charles Acton    Charles         Acton          0
15   203112           Quincy Acy     Quincy           Acy          0
16    76011          Alvan Adams      Alvan         Adams          0
17    76012            Don Adams        Don         Adams          0
18   200801         Hassan Adams     Hassan         Adams          0
19  1629121         Jaylen Adams     Jaylen         Adams          0

In [39]:
# 游늷 Reconstruir full_name usando el first_name corregido
df['full_name'] = df['first_name'] + ' ' + df['last_name']

- EXPORTAMOS EL DATAFRAME PLAYER CON TODAS LAS MODIFICACIONES Y LO NOMBRAMOS PLAYER_LIMPIO

In [41]:
# 游늷 Exportar el DataFrame limpio a CSV
df.to_csv(
    r"C:\Users\User\OneDrive\Documentos\proyecto_final\data_en_csv\player_limpio.csv",
    index=False)

print("九 Archivo exportado correctamente como player_limpio.csv")

九 Archivo exportado correctamente como player_limpio.csv